notes/2016/08/06/NewStart.org
#+STARTUP: overview
#+STARTUP: content
#+STARTUP: showall
#+STARTUP: showeverything
#+STARTUP: indent
#+STARTUP: nohideblocks
#+OPTIONS: ^:{}
#+OPTIONS: LaTeX:t
#+OPTIONS: LaTeX:dvipng
#+OPTIONS: LaTeX:nil
#+OPTIONS: LaTeX:verbatim
        
#+OPTIONS: H:3
#+OPTIONS: toc:t
#+OPTIONS: num:t
#+LANGUAGE: zh-CN
        
#+KEYWORDS: 随笔
#+TITLE: Stay Foolish Stay Hungry
#+AUTHOR: FangQian
#+EMAIL: qiangu_fang@163.com
#+DATE: 2016/08/06

* 知识
据说知识可以分为三种:
+ 你知道的
+ 你不知道的
+ 你不知道你不知道的
对于我来说，就知识而言，是十分匮乏的。虽然读了十几年书，也上了大学。但我感觉自己的学校教育阶段大部分还是浪费了。没有学到什么很深刻的知识，或者说
是没有在哪方面很专业吧。学习时间最长的应该算计算机了，但是大学期间也没有在专业方面学的特别好。虽然对Linux和Python比较感兴趣，这个也是受Leslie-Zhu
的启蒙吧。然而也是半桶水，书看的很多，也很杂，但是基本上没有哪一本是从头到位看完的，总是三天打鱼两天晒网，每当遇到不太懂的地方就会停滞不前，也是自己
毅力不够的原因吧。还有就是代码写的不多，这个在找工作面试的时候就体现出来了。有些东西明明很重要，却没有以认真的态度区学习，这些我自以为是知道的，
可是面试的时候才发现，自己真正知道的少之又少，不知道的特别多。现在也工作了一段时间了，这段时间主要也是在学习吧，接触到了很多新的专业词汇，才发现，原来我不知道自己不知道
的知识才是最多的。吾生有崖，而知也无涯。知识是永远也学不完的，能够在某个方面有点小小的成就就很满足了。

* 学习
上了这么多年学，我才发现原来我一直都不懂得去学习。很多时候都只是学了点皮毛就沾沾自喜。有时候你只是稍微了解了某个东西，然后你身边的朋友都没听过，然后就会自我感觉良好，
其实自己也只是知道这个东西叫什么而已，并不懂得它的原理，就以为自己比别人好很多了，只不过五十步笑百步罢了。这种不知道从哪里来的优越感会让自己慢慢变得没有斗志，变得平庸，
变得很狂妄自大，自以为是。渐渐明白，学习是个漫长的过程，要从一而终，学而时习之。冰冻三尺，非一日之寒。就像自己学Linux学Python,只是懂得一些比较基础的东西而已，然后自己学习
的时候翻来覆去的学习，基本看的也是在那些自以为懂了的东西，其实自己不够懂，因为实践的不够多，却自以为看了很多遍了肯定懂了，真要让自己脱离书本用到实践中来的时候才感觉到自己的懂原来是根本不懂，
自己的知识是那么的匮乏。还有很多高级东西总是望而却步，不愿意去付出，畏难。想偷懒。从来都是这样，比如老师给个任务，如果是集体的，自己从来都是依赖别人的，不会主动站出来去承担主要的任务。可能和性格
有关系吧，不够主动，在乎别人的眼光，很敏感，自卑之类的吧。不愿意区相信自己可以做到。这感觉是自己学习最大的阻碍。对于简单的东西，不肯下功夫去彻底弄懂，回过头来才发现原来还有很多简单的东西不懂。
对于那些有挑战的知识，总是学了一点点就放弃了。害怕去探索，去攀登。。。原来我一直都是这样，还死不悔改，对，这就是我，这很自己。。。
对于那些困难的有挑战行的知识，应该有一个新的认识：致XXX,感谢你们的睿智，创造了***,还要感谢你们让***这么复杂，正因如此，我才要学会这个，因为学会了这个，我会变得稍微有点与众不同^_^.

* 坚持
从小到大，仔细想想自己能够从一而终，从头到尾做好的事情感觉真没有几件。从自己的习惯就可以看出来。自律不够，很容易放弃，抵不住诱惑。就拿写博客这件事来说，大概是14年开始的吧，结果到现在也没有写一篇像样的东西出来。
总是因为各种原因就没有坚持了。总是会给自己找各种理由：比如写不好啊，没什么可写的，这个这么简单有必要写吗？这么复杂的东西我写的这么烂发出去会不会太丢人了之类的。。得了吧，谁看你写的东西啊，写博客的初衷是记录一些学习的笔记
和自己的一些思考吧，是写给自己看的，难道自己也会对自己有这么多怪异的想法和鄙视吗？？？对任何知识都要抱以一种初学者的心态去学习，每个细节。十年一剑，才敢试锋芒。最近发现好多不知道自己不知道的东西，都想去学一下。但还是先把最重要
最基础的几个点给学透彻了才好。其他的先了解入门之类的就好了。。。靠，北京的夜也这么难眠，蚊子咬一口也这么痛。。。就写到这吧。。。完全没有逻辑，失眠瞎写了一波。。。是最近书看的太少了的缘故吧。。晚安，北京！
